{
  "id": "a937b9d2-e5ca-4b40-92e5-cf27cdca8973",
  "name": "Filter_CivicDB_molecularProfile",
  "className": "PythonCoder",
  "description": "selects 'wellknown', 'lessknown' or 'notknown' molecular profiles based on the molecularProfileScore and if they have evidence",
  "group": "CUSTOM",
  "inputs": [
    {
      "key": "Code",
      "dataType": "CODE",
      "value": "# inputs\r\nresult_genes = {result_genes}\r\nfilter_type = '''{filter_type}'''\r\nthreshold = {threshold}\r\n\r\n# calculations\r\nthreshold = int(threshold)\r\nfiltered_results = {}\r\nfor g_id in result_genes.keys():\r\n    \r\n    \r\n    \r\n    \r\n\r\n    molecular_profiles_details = result_genes[g_id]['molecular_profiles_details']\r\n\r\n    # less known evidence\r\n    if filter_type == 'lessknown':\r\n        filtered_profiles = {key:molecular_profiles_details[key] for key in molecular_profiles_details.keys() if molecular_profiles_details[key]['molecularProfileScore'] < threshold}\r\n    elif filter_type == 'wellknown':\r\n        filtered_profiles = {key:molecular_profiles_details[key] for key in molecular_profiles_details.keys() if molecular_profiles_details[key]['molecularProfileScore'] >= threshold}\r\n    elif filter_type == 'notknown':\r\n        filtered_profiles = {key:molecular_profiles_details[key] for key in molecular_profiles_details.keys() if molecular_profiles_details[key]['molecularProfileScore'] < threshold}\r\n        filtered_profiles = {key: value for key, value in filtered_profiles.items() if not value['evidence_items']}\r\n        \r\n        \r\n        \r\n    filtered_results[g_id] = result_genes[g_id].copy()\r\n    filtered_results[g_id]['molecular_profiles_details'] = filtered_profiles \r\n\r\n# results\r\nresults = filtered_results",
      "templateVariables": {
        "Code.result_genes": "{'906': {'gene_name': 'CDK2', 'geneAliases': ['CDK2', 'CDKN2', 'p33(CDK2)'], 'gene_official_name': 'cyclin dependent kinase 2', 'gene_description': '', 'gene_summary': 'This gene encodes a member of a family of serine/threonine protein kinases that participate in cell cycle regulation. The encoded protein is the catalytic subunit of the cyclin-dependent protein kinase complex, which regulates progression through the cell cycle. Activity of this protein is especially critical during the G1 to S phase transition. This protein associates with and regulated by other subunits of the complex including cyclin A or E, CDK inhibitor p21Cip1 (CDKN1A), and p27Kip1 (CDKN1B). Alternative splicing results in multiple transcript variants.', 'gene_protein_domains_desc': ['Protein kinase domain', 'Protein kinase, ATP binding site', 'Protein kinase-like domain', 'Serine/threonine-protein kinase, active site', 'Serine/threonine/dual specificity protein kinase, catalytic  domain'], 'evidence_items_descriptions': ['In a Phase 2 trial, HRD score, HR deficiency status, and cytoplasmic CDK2 predicted pathologic complete remission to neoadjuvant therapy with carboplatin and eribulin in early stage TNBC patients.'], 'assertions_summaries': [], 'assertions_descriptions': [], 'abstracts': ['The purpose of this study is to evaluate the efficacy and safety of neoadjuvant treatment with carboplatin and eribulin in patients with early-stage triple negative breast cancer (TNBC), and to explore biomarkers based on DNA and protein expression profiles as predictors of response. Patients with histologically confirmed early-stage TNBC received carboplatin AUC 6 iv every 21\\xa0days, and eribulin 1.4\\xa0mg/m(2) day 1 and day 8 every 21\\xa0days for four cycles. The primary endpoint of the study was pathologic complete response (pCR), with secondary endpoints including clinical response and safety of the combination. Exploratory studies assessed DNA-based biomarkers [homologous recombination deficiency (HRD) score, and HR deficiency status (HRD score\\xa0+\\xa0BRCA1/BRCA2 mutation status)], protein-based biomarkers (Ki67, TP53, androgen receptor, Cyclin E, CDK2, Cyclin D, CDK4, Pin1 and Smad3), and clinical pretreatment factors as predictors of pCR. 13/30 (43.3\\xa0%) patients enrolled in the study achieved pCR. 24 (80.0\\xa0%) had a clinical complete or partial response. The combination was safe with mostly grade 1 and 2 toxicities. HRD score (P\\xa0=\\xa00.0024) and HR deficiency status (P\\xa0=\\xa00.0012) significantly predicted pCR. Pretreatment cytoplasmic CDK2 was also associated with pCR (P\\xa0=\\xa00.021). Significant differences in pre- versus post-treatment expression levels of nuclear Cyclin D (P\\xa0=\\xa00.020), nuclear CDK4 (P\\xa0=\\xa00.0030), and nuclear Smad3 (P\\xa0=\\xa00.015) were detected. The combination of carboplatin and eribulin is safe and efficacious in the treatment of early-stage TNBC. HRD score, HR deficiency status, and cytoplasmic CDK2 predicted pCR in this patient population.']}, '7936': {'gene_name': 'AKT3', 'geneAliases': ['AKT3', 'MPPH', 'MPPH2', 'PKB-GAMMA', 'PKBG', 'PRKBG', 'RAC-PK-gamma', 'RAC-gamma', 'STK-2'], 'gene_official_name': 'AKT serine/threonine kinase 3', 'gene_description': '', 'gene_summary': 'The protein encoded by this gene is a member of the AKT, also called PKB,  serine/threonine protein kinase family. AKT kinases are known to be regulators of cell signaling in response to insulin and growth factors. They are involved in a wide variety of biological processes including cell proliferation, differentiation, apoptosis, tumorigenesis, as well as glycogen synthesis and glucose uptake. This kinase has been shown to be stimulated by platelet-derived growth factor (PDGF), insulin, and insulin-like growth factor 1 (IGF1). Alternatively splice transcript variants encoding distinct isoforms have been described.', 'gene_protein_domains_desc': ['AGC-kinase, C-terminal', 'PH domain-like', 'Pleckstrin homology domain', 'Protein kinase domain', 'Protein kinase, ATP binding site', 'Protein kinase, C-terminal', 'Protein kinase-like domain', 'Serine/threonine-protein kinase, active site', 'Serine/threonine/dual specificity protein kinase, catalytic  domain'], 'evidence_items_descriptions': ['Upregulation of AKT3 due to epigenetic reprogramming may confer acquired resistance to AKT inhibitor (MK2206) in breast cancer preclinical model.', 'AKT3 was found to be preferentially required for the proliferation and tumor growth of TNBC. It was found to be upregulated in a set of TNBC cell lines compared to other breast cancer types. Depletion of AKT3 in TNBC sensitizes cells to the pan-Akt inhibitor GSK690693. It was found that depletion of Akt3 potentially inhibits the growth of TNBC cell lines in three-dimensional (3D) spheroid cultures and in mouse xenograft models, which imply that therapeutic targeting of AKT3 may provide a new treatment option for TNBCs.', 'Overexpression of AKT3 in lumenal breast cancer cell line SKBR3, which does not express the AKT3 isoform, induced a statistically significant 2.7 fold increase in IC50 for pan-AKT inhibitor GSK690693.', 'An in vitro study of M229 (a human melanoma cell line) endogenously expressing wildtype AKT3 and BRAF V600E (a known BRAF inhibitor sensitizing mutation) found that cells virally induced to stably over-express AKT3 E17K were significantly more resistant to BRAF inhibition via vemurafenib than cells transduced with empty vectors (40% vs 20% survival, p = .0033).', 'An in vitro study of M229 (a human melanoma cell line) endogenously expressing wildtype AKT3 and BRAF V600E (a known BRAF inhibitor sensitizing mutation) found that cells induced to stably over-express AKT3 (via viral transduction of additional copies of wild type AKT3) were significantly more resistant to BRAF inhibition by vemurafenib than cells transduced with empty vectors (30% vs 20% survival, p = .0064).'], 'assertions_summaries': [], 'assertions_descriptions': [], 'abstracts': ['Acquired resistance to molecular targeted therapy represents a major challenge for the effective treatment of cancer. Hyperactivation of the PI3K/AKT pathway is frequently observed in virtually all human malignancies, and numerous PI3K and AKT inhibitors are currently under clinical evaluation. However, mechanisms of acquired resistance to AKT inhibitors have yet to be described. Here, we use a breast cancer preclinical model to identify resistance mechanisms to a small molecule allosteric AKT inhibitor, MK2206. Using a step-wise and chronic high-dose exposure, breast cancer cell lines harboring oncogenic PI3K resistant to MK2206 were established. Using this model, we reveal that AKT3 expression is markedly upregulated in AKT inhibitor-resistant cells. Induction of AKT3 is regulated epigenetically by the bromodomain and extra terminal domain proteins. Importantly, knockdown of AKT3, but not AKT1 or AKT2, in resistant cells restores sensitivity to MK2206. AKT inhibitor-resistant cells also display an epithelial to mesenchymal transition phenotype as assessed by alterations in the levels of E-Cadherin, N-Cadherin, and vimentin, as well as enhanced invasiveness of tumor spheroids. Notably, the invasive morphology of resistant spheroids is diminished upon AKT3 depletion. We also show that resistance to MK2206 is reversible because upon drug removal resistant cells regain sensitivity to AKT inhibition, accompanied by reexpression of epithelial markers and reduction of AKT3 expression, implying that epigenetic reprogramming contributes to acquisition of resistance. These findings provide a rationale for developing therapeutics targeting AKT3 to circumvent acquired resistance in breast cancer. Mol Cancer Ther; 15(8); 1964-74. ©2016 AACR.', 'Triple-negative breast cancer (TNBC) is currently the only major breast tumor subtype without effective targeted therapy and, as a consequence, in general has a poor outcome. To identify new therapeutic targets in TNBC, we performed a short hairpin RNA (shRNA) screen for protein kinases commonly amplified and overexpressed in breast cancer. Using this approach, we identified AKT3 as a gene preferentially required for the growth of TNBCs. Downregulation of Akt3 significantly inhibits the growth of TNBC lines in three-dimensional (3D) spheroid cultures and in mouse xenograft models, whereas loss of Akt1 or Akt2 have more modest effects. Akt3 silencing markedly upregulates the p27 cell-cycle inhibitor and this is critical for the ability of Akt3 to inhibit spheroid growth. In contrast with Akt1, Akt3 silencing results in only a minor enhancement of migration and does not promote invasion. Depletion of Akt3 in TNBC sensitizes cells to the pan-Akt inhibitor GSK690693. These results imply that Akt3 has a specific function in TNBCs; thus, its therapeutic targeting may provide a new treatment option for this tumor subtype.', 'BRAF inhibitors elicit rapid antitumor responses in the majority of patients with BRAF(V600)-mutant melanoma, but acquired drug resistance is almost universal. We sought to identify the core resistance pathways and the extent of tumor heterogeneity during disease progression. We show that mitogen-activated protein kinase reactivation mechanisms were detected among 70% of disease-progressive tissues, with RAS mutations, mutant BRAF amplification, and alternative splicing being most common. We also detected PI3K-PTEN-AKT-upregulating genetic alterations among 22% of progressive melanomas. Distinct molecular lesions in both core drug escape pathways were commonly detected concurrently in the same tumor or among multiple tumors from the same patient. Beyond harboring extensively heterogeneous resistance mechanisms, melanoma regrowth emerging from BRAF inhibitor selection displayed branched evolution marked by altered mutational spectra/signatures and increased fitness. Thus, melanoma genomic heterogeneity contributes significantly to BRAF inhibitor treatment failure, implying upfront, cotargeting of two core pathways as an essential strategy for durable responses.']}}"
      },
      "componentId": null
    }
  ],
  "output": {
    "dataType": "ANY",
    "value": ":undef:"
  },
  "label": "PYTHONCODER-8",
  "configuration": {
    "force_run": "false",
    "openai_api_key": ""
  },
  "version": null,
  "isCustom": true,
  "isTerminal": false,
  "position": {
    "x": 0,
    "y": 0
  },
  "timeout": 60,
  "forceRun": false
}